## Lab SQL 2.9

In [1]:
#Currently importing data from SQL database
import pandas as pd
import numpy as np

import pymysql                        
from sqlalchemy import create_engine  

from getpass import getpass

In [2]:
#Password request from mySQL
password = getpass()

········

In [3]:
#Entering the connection spring needed to access the data
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [4]:
type(engine)

sqlalchemy.engine.base.Engine

In [5]:
#1.How many distinct (different) actors' last names are there?
query1="SELECT COUNT(DISTINCT last_name) AS DISTINCT_surnames FROM ACTOR;"

In [7]:
data1 = pd.read_sql(query1, engine)
data1.head()

   DISTINCT_surnames
0                121

In [9]:
#2: Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.
query2='''SELECT *, MONTHNAME(rental_date) AS month,
DAYNAME(rental_date) as Weekday, 
CASE 
WHEN dayname(rental_date) 
IN ('Saturday','Sunday')
THEN 'Weekend'
ELSE 'Weekday'
END
AS day_type from rental;'''

In [11]:
data2 = pd.read_sql(query2, engine)
data2.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,month,Weekday,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,May,Tuesday,Weekday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,May,Tuesday,Weekday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,May,Tuesday,Weekday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,May,Tuesday,Weekday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,May,Tuesday,Weekday

In [19]:
#3.Get all films with ARMAGEDDON in the title
query3= "SELECT * FROM FILM WHERE title LIKE '%%ARMAGEDDON%%:'"

In [20]:
data3 = pd.read_sql(query3, engine)
data3.head()

Empty DataFrame
Columns: [film_id, title, description, release_year, language_id, original_language_id, rental_duration, rental_rate, length, replacement_cost, rating, special_features, last_update]
Index: []

In [23]:
#4.Get 10 the longest films.
query4="SELECT title,length FROM film order by length desc LIMIT 10;"

In [24]:
data4 = pd.read_sql(query4, engine)
data4.head()

            title  length
0  DARN FORRESTER     185
1    POND SEATTLE     185
2   CHICAGO NORTH     185
3   MUSCLE BRIGHT     185
4    WORST BANGER     185

In [27]:
#5.How many films include Behind the Scenes content?
query5="SELECT COUNT(title) FROM film WHERE special_features LIKE '%%Behind the scenes%%';"

In [28]:
data5 = pd.read_sql(query5, engine)
data5.head()

   COUNT(title)
0           538

In [29]:
#6.Which kind of movies (rating) have a mean duration of more than two hours?
query6 = '''SELECT rating, ROUND(AVG(length),2) AS AVG_length
 from film
    GROUP BY rating
    HAVING AVG_LENGTH >120;'''

In [30]:
data6 = pd.read_sql(query6, engine)
data6.head()

  rating  AVG_length
0  PG-13      120.44

In [32]:
#7.Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.
query7= '''SELECT title,length,dense_rank()
over(order by length desc)
AS length_rank from film 
ORDER BY length desc;'''

In [33]:
data7 = pd.read_sql(query7, engine)
data7.head()

            title  length  length_rank
0   CHICAGO NORTH     185            1
1  CONTROL ANTHEM     185            1
2  DARN FORRESTER     185            1
3     GANGS PRIDE     185            1
4       HOME PITY     185            1